package com.coolslow.topics.dp;

public class Concepts {

    /*
            动态规划问题是算法面试当中的重点和难点
            动态规划是通过空间换取时间的算法思想

            什么是动态规划
                动态规划就是记住你之前得到的答案

            动态规划要考虑的两点：找出问题之间的联系，以及记录答案
                思考步骤
                    （1）问题拆解，找到问题之间的具体联系

                    （2）状态定义
                            当前问题的答案就是当前的状态
                            状态之间要有关联.

                    （3）递推方程推导

                    （4）实现
                            就是用什么样的数据结构存储记录，根据问题的要求需要做初始值的设定。


            自顶向下与自底向上的问题。
                看子问题与当前问题的顺序。子问题在上，为自上而下。子问题在前，从前往后。

            循环的问题。
                状态之间要有关联，可以减少一层嵌套。
                循环角标的起止位置与自顶向下和自底向上有关。

            边界问题：
                要对一切特殊点进行边界测试。

            状态初始化：
                状态要根据情况做初始化。
     */


}
