package com.coolslow.topics.greedy;

public class Concepts {

    /*
     *1 概念
     * 贪心算法，又名贪婪法，是寻找最优解问题的常用方法。
     *
     * 这种方法模式一般将求解过程分成若干个步骤。
     * 每个步骤都应用贪心原则，选取当前状态下最好/最优的选择。
     * 并以此希望最后堆叠出的结果也是最好/最优的解。
     *
     * 贪心算法是一种在某种范围内，局部最优的算法。最终结果并不一定是真正的最优解。
     */

    /*
     * 2 算法流程
     * （1）建立数学模型来描述问题。
     * （2）把求解的问题分成若干个子问题。
     * （3）制定贪心策略，对每一子问题求解，得到子问题的局部最优解。
     * （4）把子问题的局部最优解合成原来问题的一个解。
     */

    /*
     * 3 贪心算法适用的问题
     * 贪心策略适用的前提是：局部最优策略能导致产生全局最优解。
     * 所以对所采用的贪心策略一定要仔细分析。
     *
     */
}
