package com.coolslow.leetcode.top1000plus;

/**
 * 474. 一和零
 *
 * 在计算机世界，我们总是追求用有限的资源获取最大的收益。
 *
 * 现在，假设你分别支配着m个0和n个1。另外，还有一个仅包含0和1的字符串数组。
 * 你的任务是泗洪给定的m个0和n个1，找到能拼出存在于数组中的字符串的最大数量。
 * 每个0和1至多被使用1次。
 *
 * 示例 1:
 * 输入: strs = ["10", "0001", "111001", "1", "0"], m = 5, n = 3
 * 输出: 4
 * 解释: 总共 4 个字符串可以通过 5 个 0 和 3 个 1 拼出，即 "10","0001","1","0" 。
 *
 * 示例 2:
 * 输入: strs = ["10", "0", "1"], m = 1, n = 1
 * 输出: 2
 * 解释: 你可以拼出 "10"，但之后就没有剩余数字了。更好的选择是拼出 "0" 和 "1" 。
 *
 * -----------------------------------------------------------------------
 * 提示：
 * 1 <= strs.length <= 600
 * 1 <= strs[i].length <= 100
 * strs[i]仅由'0' 和'1' 组成
 * 1 <= m, n <= 100
 * -----------------------------------------------------------------------
 */
public class NO474_OnesAndZeroes {
}
